espressif/esp-idf/components/soc/esp32s31/register/soc/sdmmc_reg.h
/**
 * SPDX-FileCopyrightText: 2025-2026 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** SDHOST_CTRL_REG register
 *  Control register
 */
#define SDHOST_CTRL_REG (DR_REG_SDHOST_BASE + 0x0)
/** SDHOST_CONTROLLER_RESET : R/W; bitpos: [0]; default: 0;
 *  To reset controller, firmware should set this bit. This bit is auto-cleared after
 *  two AHB and two sdhost_cclk_in clock cycles.
 */
#define SDHOST_CONTROLLER_RESET    (BIT(0))
#define SDHOST_CONTROLLER_RESET_M  (SDHOST_CONTROLLER_RESET_V << SDHOST_CONTROLLER_RESET_S)
#define SDHOST_CONTROLLER_RESET_V  0x00000001U
#define SDHOST_CONTROLLER_RESET_S  0
/** SDHOST_FIFO_RESET : R/W; bitpos: [1]; default: 0;
 *  To reset FIFO, firmware should set bit to 1. This bit is auto-cleared after
 *  completion of reset operation.
 *  Note: FIFO pointers will be out of reset after 2 cycles of system clocks in
 *  addition to synchronization delay (2 cycles of card clock), after the fifo_reset is
 *  cleared.
 */
#define SDHOST_FIFO_RESET    (BIT(1))
#define SDHOST_FIFO_RESET_M  (SDHOST_FIFO_RESET_V << SDHOST_FIFO_RESET_S)
#define SDHOST_FIFO_RESET_V  0x00000001U
#define SDHOST_FIFO_RESET_S  1
/** SDHOST_DMA_RESET : R/W; bitpos: [2]; default: 0;
 *  To reset DMA interface, firmware should set bit to 1. This bit is auto-cleared
 *  after two AHB clocks.
 */
#define SDHOST_DMA_RESET    (BIT(2))
#define SDHOST_DMA_RESET_M  (SDHOST_DMA_RESET_V << SDHOST_DMA_RESET_S)
#define SDHOST_DMA_RESET_V  0x00000001U
#define SDHOST_DMA_RESET_S  2
/** SDHOST_INT_ENABLE : R/W; bitpos: [4]; default: 0;
 *  Global interrupt enable/disable bit. 0: Disable; 1: Enable.
 */
#define SDHOST_INT_ENABLE    (BIT(4))
#define SDHOST_INT_ENABLE_M  (SDHOST_INT_ENABLE_V << SDHOST_INT_ENABLE_S)
#define SDHOST_INT_ENABLE_V  0x00000001U
#define SDHOST_INT_ENABLE_S  4
/** SDHOST_READ_WAIT : R/W; bitpos: [6]; default: 0;
 *  For sending read-wait to SDIO cards.
 */
#define SDHOST_READ_WAIT    (BIT(6))
#define SDHOST_READ_WAIT_M  (SDHOST_READ_WAIT_V << SDHOST_READ_WAIT_S)
#define SDHOST_READ_WAIT_V  0x00000001U
#define SDHOST_READ_WAIT_S  6
/** SDHOST_SEND_IRQ_RESPONSE : R/W; bitpos: [7]; default: 0;
 *  Bit automatically clears once response is sent. To wait for MMC card interrupts,
 *  host issues CMD40 and waits for interrupt response from MMC card(s). In the
 *  meantime, if host wants SD/MMC to exit waiting for interrupt state, it can set this
 *  bit, at which time SD/MMC command state-machine sends CMD40 response on bus and
 *  returns to idle state.
 */
#define SDHOST_SEND_IRQ_RESPONSE    (BIT(7))
#define SDHOST_SEND_IRQ_RESPONSE_M  (SDHOST_SEND_IRQ_RESPONSE_V << SDHOST_SEND_IRQ_RESPONSE_S)
#define SDHOST_SEND_IRQ_RESPONSE_V  0x00000001U
#define SDHOST_SEND_IRQ_RESPONSE_S  7
/** SDHOST_ABORT_READ_DATA : R/W; bitpos: [8]; default: 0;
 *  After a suspend-command is issued during a read-operation, software polls the card
 *  to find when the suspend-event occurred. Once the suspend-event has occurred,
 *  software sets the bit which will reset the data state machine that is waiting for
 *  the next block of data. This bit is automatically cleared once the data state
 *  machine is reset to idle.
 */
#define SDHOST_ABORT_READ_DATA    (BIT(8))
#define SDHOST_ABORT_READ_DATA_M  (SDHOST_ABORT_READ_DATA_V << SDHOST_ABORT_READ_DATA_S)
#define SDHOST_ABORT_READ_DATA_V  0x00000001U
#define SDHOST_ABORT_READ_DATA_S  8
/** SDHOST_SEND_CCSD : R/W; bitpos: [9]; default: 0;
 *  When set, SD/MMC sends CCSD to the CE-ATA device. Software sets this bit only if
 *  the current command is expecting CCS (that is, RW_BLK), and if interrupts are
 *  enabled for the CE-ATA device. Once the CCSD pattern is sent to the device, SD/MMC
 *  automatically clears the SDHOST_SEND_CCSD bit. It also sets the Command Done (CD)
 *  bit  in the SDHOST_RINTSTS_REG register, and generates an interrupt for the host,
 *  in case the Command Done interrupt is not masked.
 *  NOTE: Once the SDHOST_SEND_CCSD bit is set, it takes two card clock cycles to drive
 *  the CCSD on the CMD line. Due to this, within the boundary conditions the CCSD may
 *  be sent to the CE-ATA device, even if the device has signalled CCS.
 */
#define SDHOST_SEND_CCSD    (BIT(9))
#define SDHOST_SEND_CCSD_M  (SDHOST_SEND_CCSD_V << SDHOST_SEND_CCSD_S)
#define SDHOST_SEND_CCSD_V  0x00000001U
#define SDHOST_SEND_CCSD_S  9
/** SDHOST_SEND_AUTO_STOP_CCSD : R/W; bitpos: [10]; default: 0;
 *  Always Set SDHOST_SEND_AUTO_STOP_CCSD and SDHOST_SEND_CCSD bits together;
 *  SDHOST_SEND_AUTO_STOP_CCSD should not be set independently of send_ccsd. When set,
 *  SD/MMC automatically sends an internally-generated STOP command (CMD12) to the
 *  CE-ATA device. After sending this internally-generated STOP command, the Auto
 *  Command Done (ACD) bit in SDHOST_RINTSTS_REG is set and an interrupt is generated
 *  for the host, in case the ACD interrupt is not masked. After sending the Command
 *  Completion Signal Disable (CCSD), SD/MMC automatically clears the
 *  SDHOST_SEND_AUTO_STOP_CCSD bit.
 */
#define SDHOST_SEND_AUTO_STOP_CCSD    (BIT(10))
#define SDHOST_SEND_AUTO_STOP_CCSD_M  (SDHOST_SEND_AUTO_STOP_CCSD_V << SDHOST_SEND_AUTO_STOP_CCSD_S)
#define SDHOST_SEND_AUTO_STOP_CCSD_V  0x00000001U
#define SDHOST_SEND_AUTO_STOP_CCSD_S  10
/** SDHOST_CEATA_DEVICE_INTERRUPT_STATUS : R/W; bitpos: [11]; default: 0;
 *  Software should appropriately write to this bit after the power-on reset or any
 *  other reset to the CE-ATA device. After reset, the CE-ATA device's interrupt is
 *  usually disabled (nIEN = 1). If the host enables the CE-ATA device's interrupt,
 *  then software should set this bit.
 */
#define SDHOST_CEATA_DEVICE_INTERRUPT_STATUS    (BIT(11))
#define SDHOST_CEATA_DEVICE_INTERRUPT_STATUS_M  (SDHOST_CEATA_DEVICE_INTERRUPT_STATUS_V << SDHOST_CEATA_DEVICE_INTERRUPT_STATUS_S)
#define SDHOST_CEATA_DEVICE_INTERRUPT_STATUS_V  0x00000001U
#define SDHOST_CEATA_DEVICE_INTERRUPT_STATUS_S  11

/** SDHOST_CLKDIV_REG register
 *  Clock divider configuration register
 */
#define SDHOST_CLKDIV_REG (DR_REG_SDHOST_BASE + 0x8)
/** SDHOST_CLK_DIVIDER0 : R/W; bitpos: [7:0]; default: 0;
 *  Clock divider0 value. Clock divisor is 2*n, where n = 0 bypasses the divider
 *  (divisor of 1). For example, a value of 1 means divided by 2*1 = 2, a value of 0xFF
 *  means divided by 2*255 = 510, and so on.
 */
#define SDHOST_CLK_DIVIDER0    0x000000FFU
#define SDHOST_CLK_DIVIDER0_M  (SDHOST_CLK_DIVIDER0_V << SDHOST_CLK_DIVIDER0_S)
#define SDHOST_CLK_DIVIDER0_V  0x000000FFU
#define SDHOST_CLK_DIVIDER0_S  0
/** SDHOST_CLK_DIVIDER1 : R/W; bitpos: [15:8]; default: 0;
 *  Clock divider1 value. Clock divisor is 2*n, where n = 0 bypasses the divider
 *  (divisor of 1). For example, a value of 1 means divided by 2*1 = 2, a value of 0xFF
 *  means divided by 2*255 = 510, and so on.
 */
#define SDHOST_CLK_DIVIDER1    0x000000FFU
#define SDHOST_CLK_DIVIDER1_M  (SDHOST_CLK_DIVIDER1_V << SDHOST_CLK_DIVIDER1_S)
#define SDHOST_CLK_DIVIDER1_V  0x000000FFU
#define SDHOST_CLK_DIVIDER1_S  8
/** SDHOST_CLK_DIVIDER2 : R/W; bitpos: [23:16]; default: 0;
 *  Clock divider2 value. Clock divisor is 2*n, where n = 0 bypasses the divider
 *  (divisor of 1). For example, a value of 1 means divided by 2*1 = 2, a value of 0xFF
 *  means divided by 2*255 = 510, and so on.
 */
#define SDHOST_CLK_DIVIDER2    0x000000FFU
#define SDHOST_CLK_DIVIDER2_M  (SDHOST_CLK_DIVIDER2_V << SDHOST_CLK_DIVIDER2_S)
#define SDHOST_CLK_DIVIDER2_V  0x000000FFU
#define SDHOST_CLK_DIVIDER2_S  16
/** SDHOST_CLK_DIVIDER3 : R/W; bitpos: [31:24]; default: 0;
 *  Clock divider3 value. Clock divisor is 2*n, where n = 0 bypasses the divider
 *  (divisor of 1). For example, a value of 1 means divided by 2*1 = 2, a value of 0xFF
 *  means divided by 2*255 = 510, and so on.
 */
#define SDHOST_CLK_DIVIDER3    0x000000FFU
#define SDHOST_CLK_DIVIDER3_M  (SDHOST_CLK_DIVIDER3_V << SDHOST_CLK_DIVIDER3_S)
#define SDHOST_CLK_DIVIDER3_V  0x000000FFU
#define SDHOST_CLK_DIVIDER3_S  24

/** SDHOST_CLKSRC_REG register
 *  Clock source selection register
 */
#define SDHOST_CLKSRC_REG (DR_REG_SDHOST_BASE + 0xc)
/** SDHOST_CLKSRC : R/W; bitpos: [3:0]; default: 0;
 *  Clock divider source for two SD cards is supported. Each card has two bits assigned
 *  to it. For example, bit[1:0] are assigned for card 0, bit[3:2] are assigned for
 *  card 1. Card 0 maps and internally routes clock divider[0:3] outputs to
 *  cclk_out[1:0] pins, depending on bit value.
 *  00 : Clock divider 0;
 *  01 : Clock divider 1;
 *  10 : Clock divider 2;
 *  11 : Clock divider 3.
 */
#define SDHOST_CLKSRC    0x0000000FU
#define SDHOST_CLKSRC_M  (SDHOST_CLKSRC_V << SDHOST_CLKSRC_S)
#define SDHOST_CLKSRC_V  0x0000000FU
#define SDHOST_CLKSRC_S  0

/** SDHOST_CLKENA_REG register
 *  Clock enable register
 */
#define SDHOST_CLKENA_REG (DR_REG_SDHOST_BASE + 0x10)
/** SDHOST_CCLK_ENABLE : R/W; bitpos: [1:0]; default: 0;
 *  Clock-enable control for two SD card clocks and one MMC card clock is supported.
 *  One bit per card.
 *  0: Clock disabled;
 *  1: Clock enabled.
 */
#define SDHOST_CCLK_ENABLE    0x00000003U
#define SDHOST_CCLK_ENABLE_M  (SDHOST_CCLK_ENABLE_V << SDHOST_CCLK_ENABLE_S)
#define SDHOST_CCLK_ENABLE_V  0x00000003U
#define SDHOST_CCLK_ENABLE_S  0
/** SDHOST_LP_ENABLE : R/W; bitpos: [17:16]; default: 0;
 *  Disable clock when the card is in IDLE state. One bit per card.
 *  0: clock disabled;
 *  1: clock enabled.
 */
#define SDHOST_LP_ENABLE    0x00000003U
#define SDHOST_LP_ENABLE_M  (SDHOST_LP_ENABLE_V << SDHOST_LP_ENABLE_S)
#define SDHOST_LP_ENABLE_V  0x00000003U
#define SDHOST_LP_ENABLE_S  16

/** SDHOST_TMOUT_REG register
 *  Data and response timeout configuration register
 */
#define SDHOST_TMOUT_REG (DR_REG_SDHOST_BASE + 0x14)
/** SDHOST_RESPONSE_TIMEOUT : R/W; bitpos: [7:0]; default: 64;
 *  Response timeout value. Value is specified in terms of number of card output
 *  clocks, i.e., sdhost_cclk_out.
 */
#define SDHOST_RESPONSE_TIMEOUT    0x000000FFU
#define SDHOST_RESPONSE_TIMEOUT_M  (SDHOST_RESPONSE_TIMEOUT_V << SDHOST_RESPONSE_TIMEOUT_S)
#define SDHOST_RESPONSE_TIMEOUT_V  0x000000FFU
#define SDHOST_RESPONSE_TIMEOUT_S  0
/** SDHOST_DATA_TIMEOUT : R/W; bitpos: [31:8]; default: 16777215;
 *  Value for card data read timeout. This value is also used for data starvation by
 *  host timeout. The timeout counter is started only after the card clock is stopped.
 *  This value is specified in number of card output clocks, i.e. sdhost_cclk_out of
 *  the selected card.
 *  NOTE: The software timer should be used if the timeout value is in the order of 100
 *  ms. In this case, read data timeout interrupt needs to be disabled.
 */
#define SDHOST_DATA_TIMEOUT    0x00FFFFFFU
#define SDHOST_DATA_TIMEOUT_M  (SDHOST_DATA_TIMEOUT_V << SDHOST_DATA_TIMEOUT_S)
#define SDHOST_DATA_TIMEOUT_V  0x00FFFFFFU
#define SDHOST_DATA_TIMEOUT_S  8

/** SDHOST_CTYPE_REG register
 *  Card bus width configuration register
 */
#define SDHOST_CTYPE_REG (DR_REG_SDHOST_BASE + 0x18)
/** SDHOST_CARD_WIDTH4 : R/W; bitpos: [1:0]; default: 0;
 *  One bit per card indicates if card is 1-bit or 4-bit mode.
 *  0: 1-bit mode;
 *  1: 4-bit mode.
 *  Bit[1:0] correspond to card[1:0] respectively.
 */
#define SDHOST_CARD_WIDTH4    0x00000003U
#define SDHOST_CARD_WIDTH4_M  (SDHOST_CARD_WIDTH4_V << SDHOST_CARD_WIDTH4_S)
#define SDHOST_CARD_WIDTH4_V  0x00000003U
#define SDHOST_CARD_WIDTH4_S  0
/** SDHOST_CARD_WIDTH8 : R/W; bitpos: [17:16]; default: 0;
 *  One bit per card indicates if card is in 8-bit mode.
 *  0: Non 8-bit mode;
 *  1: 8-bit mode.
 *  Bit[17:16] correspond to card[1:0] respectively.
 */
#define SDHOST_CARD_WIDTH8    0x00000003U
#define SDHOST_CARD_WIDTH8_M  (SDHOST_CARD_WIDTH8_V << SDHOST_CARD_WIDTH8_S)
#define SDHOST_CARD_WIDTH8_V  0x00000003U
#define SDHOST_CARD_WIDTH8_S  16

/** SDHOST_BLKSIZ_REG register
 *  Card data block size configuration register
 */
#define SDHOST_BLKSIZ_REG (DR_REG_SDHOST_BASE + 0x1c)
/** SDHOST_BLOCK_SIZE : R/W; bitpos: [15:0]; default: 512;
 *  Block size.
 */
#define SDHOST_BLOCK_SIZE    0x0000FFFFU
#define SDHOST_BLOCK_SIZE_M  (SDHOST_BLOCK_SIZE_V << SDHOST_BLOCK_SIZE_S)
#define SDHOST_BLOCK_SIZE_V  0x0000FFFFU
#define SDHOST_BLOCK_SIZE_S  0

