espressif/esp-idf/components/soc/esp32s31/register/soc/sdmmc_reg.h
/** SDHOST_BYTCNT_REG register
 *  Data transfer length configuration register
 */
#define SDHOST_BYTCNT_REG (DR_REG_SDHOST_BASE + 0x20)
/** SDHOST_BYTE_COUNT : R/W; bitpos: [31:0]; default: 512;
 *  Number of bytes to be transferred, should be an integral multiple of Block Size for
 *  block transfers. For data transfers of undefined byte lengths, byte count should be
 *  set to 0. When byte count is set to 0, it is the responsibility of host to
 *  explicitly send stop/abort command to terminate data transfer.
 */
#define SDHOST_BYTE_COUNT    0xFFFFFFFFU
#define SDHOST_BYTE_COUNT_M  (SDHOST_BYTE_COUNT_V << SDHOST_BYTE_COUNT_S)
#define SDHOST_BYTE_COUNT_V  0xFFFFFFFFU
#define SDHOST_BYTE_COUNT_S  0

/** SDHOST_INTMASK_REG register
 *  SDIO interrupt mask register
 */
#define SDHOST_INTMASK_REG (DR_REG_SDHOST_BASE + 0x24)
/** SDHOST_INT_MASK : R/W; bitpos: [15:0]; default: 0;
 *  These bits used to mask unwanted interrupts. A value of 0 masks interrupt, and a
 *  value of 1 enables the interrupt.
 *  Bit 15 (EBE): End-bit error/no CRC error;
 *  Bit 14 (ACD): Auto command done;
 *  Bit 13 (SBE/BCI): Rx Start Bit Error;
 *  Bit 12 (HLE): Hardware locked write error;
 *  Bit 11 (FRUN): FIFO underrun/overrun error;
 *  Bit 10 (HTO): Data starvation-by-host timeout;
 *  Bit 9 (DRTO): Data read timeout;
 *  Bit 8 (RTO): Response timeout;
 *  Bit 7 (DCRC): Data CRC error;
 *  Bit 6 (RCRC): Response CRC error;
 *  Bit 5 (RXDR): Receive FIFO data request;
 *  Bit 4 (TXDR): Transmit FIFO data request;
 *  Bit 3 (DTO): Data transfer over;
 *  Bit 2 (CD): Command done;
 *  Bit 1 (RE): Response error;
 *  Bit 0 (CD): Card detect.
 */
#define SDHOST_INT_MASK    0x0000FFFFU
#define SDHOST_INT_MASK_M  (SDHOST_INT_MASK_V << SDHOST_INT_MASK_S)
#define SDHOST_INT_MASK_V  0x0000FFFFU
#define SDHOST_INT_MASK_S  0
/** SDHOST_SDIO_INT_MASK : R/W; bitpos: [17:16]; default: 0;
 *  SDIO interrupt mask, one bit for each card. Bit[17:16] correspond to card[15:0]
 *  respectively. When masked, SDIO interrupt detection for that card is disabled. 0
 *  masks an interrupt, and 1 enables an interrupt.
 */
#define SDHOST_SDIO_INT_MASK    0x00000003U
#define SDHOST_SDIO_INT_MASK_M  (SDHOST_SDIO_INT_MASK_V << SDHOST_SDIO_INT_MASK_S)
#define SDHOST_SDIO_INT_MASK_V  0x00000003U
#define SDHOST_SDIO_INT_MASK_S  16

/** SDHOST_CMDARG_REG register
 *  Command argument data register
 */
#define SDHOST_CMDARG_REG (DR_REG_SDHOST_BASE + 0x28)
/** SDHOST_CMDARG : R/W; bitpos: [31:0]; default: 0;
 *  Value indicates command argument to be passed to the card.
 */
#define SDHOST_CMDARG    0xFFFFFFFFU
#define SDHOST_CMDARG_M  (SDHOST_CMDARG_V << SDHOST_CMDARG_S)
#define SDHOST_CMDARG_V  0xFFFFFFFFU
#define SDHOST_CMDARG_S  0

/** SDHOST_CMD_REG register
 *  Command and boot configuration register
 */
#define SDHOST_CMD_REG (DR_REG_SDHOST_BASE + 0x2c)
/** SDHOST_CMD_INDEX : R/W; bitpos: [5:0]; default: 0;
 *  Command index.
 */
#define SDHOST_CMD_INDEX    0x0000003FU
#define SDHOST_CMD_INDEX_M  (SDHOST_CMD_INDEX_V << SDHOST_CMD_INDEX_S)
#define SDHOST_CMD_INDEX_V  0x0000003FU
#define SDHOST_CMD_INDEX_S  0
/** SDHOST_RESPONSE_EXPECT : R/W; bitpos: [6]; default: 0;
 *  0: No response expected from card; 1: Response expected from card.
 */
#define SDHOST_RESPONSE_EXPECT    (BIT(6))
#define SDHOST_RESPONSE_EXPECT_M  (SDHOST_RESPONSE_EXPECT_V << SDHOST_RESPONSE_EXPECT_S)
#define SDHOST_RESPONSE_EXPECT_V  0x00000001U
#define SDHOST_RESPONSE_EXPECT_S  6
/** SDHOST_RESPONSE_LENGTH : R/W; bitpos: [7]; default: 0;
 *  0: Short response expected from card; 1: Long response expected from card.
 */
#define SDHOST_RESPONSE_LENGTH    (BIT(7))
#define SDHOST_RESPONSE_LENGTH_M  (SDHOST_RESPONSE_LENGTH_V << SDHOST_RESPONSE_LENGTH_S)
#define SDHOST_RESPONSE_LENGTH_V  0x00000001U
#define SDHOST_RESPONSE_LENGTH_S  7
/** SDHOST_CHECK_RESPONSE_CRC : R/W; bitpos: [8]; default: 0;
 *  0: Do not check; 1: Check response CRC.
 *  Some of command responses do not return valid CRC bits. Software should disable CRC
 *  checks for those commands in order to disable CRC checking by controller.
 */
#define SDHOST_CHECK_RESPONSE_CRC    (BIT(8))
#define SDHOST_CHECK_RESPONSE_CRC_M  (SDHOST_CHECK_RESPONSE_CRC_V << SDHOST_CHECK_RESPONSE_CRC_S)
#define SDHOST_CHECK_RESPONSE_CRC_V  0x00000001U
#define SDHOST_CHECK_RESPONSE_CRC_S  8
/** SDHOST_DATA_EXPECTED : R/W; bitpos: [9]; default: 0;
 *  0: No data transfer expected; 1: Data transfer expected.
 */
#define SDHOST_DATA_EXPECTED    (BIT(9))
#define SDHOST_DATA_EXPECTED_M  (SDHOST_DATA_EXPECTED_V << SDHOST_DATA_EXPECTED_S)
#define SDHOST_DATA_EXPECTED_V  0x00000001U
#define SDHOST_DATA_EXPECTED_S  9
/** SDHOST_READ_WRITE : R/W; bitpos: [10]; default: 0;
 *  0: Read from card; 1: Write to card.
 *  Don't care if no data is expected from card.
 */
#define SDHOST_READ_WRITE    (BIT(10))
#define SDHOST_READ_WRITE_M  (SDHOST_READ_WRITE_V << SDHOST_READ_WRITE_S)
#define SDHOST_READ_WRITE_V  0x00000001U
#define SDHOST_READ_WRITE_S  10
/** SDHOST_TRANSFER_MODE : R/W; bitpos: [11]; default: 0;
 *  0: Block data transfer command; 1: Stream data transfer command.
 *  Don't care if no data expected.
 */
#define SDHOST_TRANSFER_MODE    (BIT(11))
#define SDHOST_TRANSFER_MODE_M  (SDHOST_TRANSFER_MODE_V << SDHOST_TRANSFER_MODE_S)
#define SDHOST_TRANSFER_MODE_V  0x00000001U
#define SDHOST_TRANSFER_MODE_S  11
/** SDHOST_SEND_AUTO_STOP : R/W; bitpos: [12]; default: 0;
 *  0: No stop command is sent at the end of data transfer; 1: Send stop command at the
 *  end of data transfer.
 */
#define SDHOST_SEND_AUTO_STOP    (BIT(12))
#define SDHOST_SEND_AUTO_STOP_M  (SDHOST_SEND_AUTO_STOP_V << SDHOST_SEND_AUTO_STOP_S)
#define SDHOST_SEND_AUTO_STOP_V  0x00000001U
#define SDHOST_SEND_AUTO_STOP_S  12
/** SDHOST_WAIT_PRVDATA_COMPLETE : R/W; bitpos: [13]; default: 0;
 *  0: Send command at once, even if previous data transfer has not completed; 1: Wait
 *  for previous data transfer to complete before sending Command.
 *  The SDHOST_WAIT_PRVDATA_COMPLETE] = 0 option is typically used to query status of
 *  card during data transfer or to stop current data transfer. SDHOST_CARD_NUMBERr
 *  should be same as in previous command.
 */
#define SDHOST_WAIT_PRVDATA_COMPLETE    (BIT(13))
#define SDHOST_WAIT_PRVDATA_COMPLETE_M  (SDHOST_WAIT_PRVDATA_COMPLETE_V << SDHOST_WAIT_PRVDATA_COMPLETE_S)
#define SDHOST_WAIT_PRVDATA_COMPLETE_V  0x00000001U
#define SDHOST_WAIT_PRVDATA_COMPLETE_S  13
/** SDHOST_STOP_ABORT_CMD : R/W; bitpos: [14]; default: 0;
 *  0: Neither stop nor abort command can stop current data transfer. If abort is sent
 *  to function-number currently selected or not in data-transfer mode, then bit should
 *  be set to 0; 1: Stop or abort command intended to stop current data transfer in
 *  progress.
 *  When open-ended or predefined data transfer is in progress, and host issues stop or
 *  abort command to stop data transfer, bit should be set so that command/data
 *  state-machines of CIU can return correctly to idle state.
 */
#define SDHOST_STOP_ABORT_CMD    (BIT(14))
#define SDHOST_STOP_ABORT_CMD_M  (SDHOST_STOP_ABORT_CMD_V << SDHOST_STOP_ABORT_CMD_S)
#define SDHOST_STOP_ABORT_CMD_V  0x00000001U
#define SDHOST_STOP_ABORT_CMD_S  14
/** SDHOST_SEND_INITIALIZATION : R/W; bitpos: [15]; default: 0;
 *  0: Do not send initialization sequence (80 clocks of 1) before sending this
 *  command; 1: Send initialization sequence before sending this command.
 *  After powered on, 80 clocks must be sent to card for initialization before sending
 *  any commands to card. Bit should be set while sending first command to card so that
 *  controller will initialize clocks before sending command to card.
 */
#define SDHOST_SEND_INITIALIZATION    (BIT(15))
#define SDHOST_SEND_INITIALIZATION_M  (SDHOST_SEND_INITIALIZATION_V << SDHOST_SEND_INITIALIZATION_S)
#define SDHOST_SEND_INITIALIZATION_V  0x00000001U
#define SDHOST_SEND_INITIALIZATION_S  15
/** SDHOST_CARD_NUMBER : R/W; bitpos: [20:16]; default: 0;
 *  Card number in use. Represents physical slot number of card being accessed. In
 *  SD-only mode, up to two cards are supported.
 */
#define SDHOST_CARD_NUMBER    0x0000001FU
#define SDHOST_CARD_NUMBER_M  (SDHOST_CARD_NUMBER_V << SDHOST_CARD_NUMBER_S)
#define SDHOST_CARD_NUMBER_V  0x0000001FU
#define SDHOST_CARD_NUMBER_S  16
/** SDHOST_UPDATE_CLOCK_REGISTERS_ONLY : R/W; bitpos: [21]; default: 0;
 *  0: Normal command sequence; 1: Do not send commands, just update clock register
 *  value into card clock domain.
 *  Following register values are transferred into card clock domain: CLKDIV, CLRSRC,
 *  and CLKENA.
 *  Changes card clocks (change frequency, truncate off or on, and set low-frequency
 *  mode). This is provided in order to change clock frequency or stop clock without
 *  having to send command to cards. During normal command sequence, when
 *  sdhost_update_clock_registers_only = 0, following control registers are transferred
 *  from BIU to CIU: CMD, CMDARG, TMOUT, CTYPE, BLKSIZ, and BYTCNT. CIU uses new
 *  register values for new command sequence to card(s). When bit is set, there are no
 *  Command Done interrupts because no command is sent to SD_MMC_CEATA cards.
 */
#define SDHOST_UPDATE_CLOCK_REGISTERS_ONLY    (BIT(21))
#define SDHOST_UPDATE_CLOCK_REGISTERS_ONLY_M  (SDHOST_UPDATE_CLOCK_REGISTERS_ONLY_V << SDHOST_UPDATE_CLOCK_REGISTERS_ONLY_S)
#define SDHOST_UPDATE_CLOCK_REGISTERS_ONLY_V  0x00000001U
#define SDHOST_UPDATE_CLOCK_REGISTERS_ONLY_S  21
/** SDHOST_READ_CEATA_DEVICE : R/W; bitpos: [22]; default: 0;
 *  Read access flag.
 *  0: Host is not performing read access (RW_REG or RW_BLK)towards CE-ATA device;
 *  1: Host is performing read access (RW_REG or RW_BLK) towards CE-ATA device.
 *  Software should set this bit to indicate that CE-ATA device is being accessed for
 *  read transfer. This bit is used to disable read data timeout indication while
 *  performing CE-ATA read transfers. Maximum value of I/O transmission delay can be no
 *  less than 10 seconds. SD/MMC should not indicate read data timeout while waiting
 *  for data from CE-ATA device.
 */
#define SDHOST_READ_CEATA_DEVICE    (BIT(22))
#define SDHOST_READ_CEATA_DEVICE_M  (SDHOST_READ_CEATA_DEVICE_V << SDHOST_READ_CEATA_DEVICE_S)
#define SDHOST_READ_CEATA_DEVICE_V  0x00000001U
#define SDHOST_READ_CEATA_DEVICE_S  22
/** SDHOST_CCS_EXPECTED : R/W; bitpos: [23]; default: 0;
 *  Expected Command Completion Signal (CCS) configuration.
 *  0: Interrupts are not enabled in CE-ATA device (nIEN = 1 in ATA control register),
 *  or command does not expect CCS from device;
 *  1: Interrupts are enabled in CE-ATA device (nIEN = 0), and RW_BLK command expects
 *  command completion signal from CE-ATA device.
 *  If the command expects Command Completion Signal (CCS) from the CE-ATA device, the
 *  software should set this control bit. SD/MMC sets Data Transfer Over (DTO) bit in
 *  RINTSTS register and generates interrupt to host if Data Transfer Over interrupt is
 *  not masked.
 */
#define SDHOST_CCS_EXPECTED    (BIT(23))
#define SDHOST_CCS_EXPECTED_M  (SDHOST_CCS_EXPECTED_V << SDHOST_CCS_EXPECTED_S)
#define SDHOST_CCS_EXPECTED_V  0x00000001U
#define SDHOST_CCS_EXPECTED_S  23
/** SDHOST_USE_HOLE_REG : R/W; bitpos: [29]; default: 1;
 *  Use Hold Register.
 *  0: CMD and DATA sent to card bypassing HOLD Register;
 *  1: CMD and DATA sent to card through the HOLD Register.
 */
#define SDHOST_USE_HOLE_REG    (BIT(29))
#define SDHOST_USE_HOLE_REG_M  (SDHOST_USE_HOLE_REG_V << SDHOST_USE_HOLE_REG_S)
#define SDHOST_USE_HOLE_REG_V  0x00000001U
#define SDHOST_USE_HOLE_REG_S  29
/** SDHOST_START_CMD : R/W; bitpos: [31]; default: 0;
 *  Start command. Once command is served by the CIU, this bit is automatically
 *  cleared. When this bit is set, host should not attempt to write to any command
 *  registers. If a write is attempted, hardware lock error is set in raw interrupt
 *  register. Once command is sent and a response is received from SD_MMC_CEATA cards,
 *  Command Done bit is set in the raw interrupt Register.
 */
#define SDHOST_START_CMD    (BIT(31))
#define SDHOST_START_CMD_M  (SDHOST_START_CMD_V << SDHOST_START_CMD_S)
#define SDHOST_START_CMD_V  0x00000001U
#define SDHOST_START_CMD_S  31

/** SDHOST_RESP0_REG register
 *  Response data register
 */
#define SDHOST_RESP0_REG (DR_REG_SDHOST_BASE + 0x30)
/** SDHOST_RESPONSE0_REG : RO; bitpos: [31:0]; default: 0;
 *  Bit[31:0] of response.
 */
#define SDHOST_RESPONSE0_REG    0xFFFFFFFFU
#define SDHOST_RESPONSE0_REG_M  (SDHOST_RESPONSE0_REG_V << SDHOST_RESPONSE0_REG_S)
#define SDHOST_RESPONSE0_REG_V  0xFFFFFFFFU
#define SDHOST_RESPONSE0_REG_S  0

