espressif/esp-idf/components/soc/esp32s31/register/soc/sdmmc_reg.h
/** SDHOST_RESP1_REG register
 *  Long response data register
 */
#define SDHOST_RESP1_REG (DR_REG_SDHOST_BASE + 0x34)
/** SDHOST_RESPONSE1_REG : RO; bitpos: [31:0]; default: 0;
 *  Bit[63:32] of long response.
 */
#define SDHOST_RESPONSE1_REG    0xFFFFFFFFU
#define SDHOST_RESPONSE1_REG_M  (SDHOST_RESPONSE1_REG_V << SDHOST_RESPONSE1_REG_S)
#define SDHOST_RESPONSE1_REG_V  0xFFFFFFFFU
#define SDHOST_RESPONSE1_REG_S  0

/** SDHOST_RESP2_REG register
 *  Long response data register
 */
#define SDHOST_RESP2_REG (DR_REG_SDHOST_BASE + 0x38)
/** SDHOST_RESPONSE2_REG : RO; bitpos: [31:0]; default: 0;
 *  Bit[95:64] of long response.
 */
#define SDHOST_RESPONSE2_REG    0xFFFFFFFFU
#define SDHOST_RESPONSE2_REG_M  (SDHOST_RESPONSE2_REG_V << SDHOST_RESPONSE2_REG_S)
#define SDHOST_RESPONSE2_REG_V  0xFFFFFFFFU
#define SDHOST_RESPONSE2_REG_S  0

/** SDHOST_RESP3_REG register
 *  Long response data register
 */
#define SDHOST_RESP3_REG (DR_REG_SDHOST_BASE + 0x3c)
/** SDHOST_RESPONSE3_REG : RO; bitpos: [31:0]; default: 0;
 *  Bit[127:96] of long response.
 */
#define SDHOST_RESPONSE3_REG    0xFFFFFFFFU
#define SDHOST_RESPONSE3_REG_M  (SDHOST_RESPONSE3_REG_V << SDHOST_RESPONSE3_REG_S)
#define SDHOST_RESPONSE3_REG_V  0xFFFFFFFFU
#define SDHOST_RESPONSE3_REG_S  0

/** SDHOST_MINTSTS_REG register
 *  Masked interrupt status register
 */
#define SDHOST_MINTSTS_REG (DR_REG_SDHOST_BASE + 0x40)
/** SDHOST_INT_STATUS_MSK : RO; bitpos: [15:0]; default: 0;
 *  Interrupt enabled only if corresponding bit in interrupt mask register is set.
 *  Bit 15 (EBE): End-bit error/no CRC error;
 *  Bit 14 (ACD): Auto command done;
 *  Bit 13 (SBE/BCI): RX Start Bit Error;
 *  Bit 12 (HLE): Hardware locked write error;
 *  Bit 11 (FRUN): FIFO underrun/overrun error;
 *  Bit 10 (HTO): Data starvation by host timeout (HTO);
 *  Bit 9 (DTRO): Data read timeout;
 *  Bit 8 (RTO): Response timeout;
 *  Bit 7 (DCRC): Data CRC error;
 *  Bit 6 (RCRC): Response CRC error;
 *  Bit 5 (RXDR): Receive FIFO data request;
 *  Bit 4 (TXDR): Transmit FIFO data request;
 *  Bit 3 (DTO): Data transfer over;
 *  Bit 2 (CD): Command done;
 *  Bit 1 (RE): Response error;
 *  Bit 0 (CD): Card detect.
 */
#define SDHOST_INT_STATUS_MSK    0x0000FFFFU
#define SDHOST_INT_STATUS_MSK_M  (SDHOST_INT_STATUS_MSK_V << SDHOST_INT_STATUS_MSK_S)
#define SDHOST_INT_STATUS_MSK_V  0x0000FFFFU
#define SDHOST_INT_STATUS_MSK_S  0
/** SDHOST_SDIO_INTERRUPT_MSK : RO; bitpos: [17:16]; default: 0;
 *  Interrupt from SDIO card, one bit for each card. Bit[17:16] correspond to card1 and
 *  card0, respectively. SDIO interrupt for card is enabled only if corresponding
 *  sdhost_sdio_int_mask bit is set in Interrupt mask register (Setting mask bit
 *  enables interrupt).
 */
#define SDHOST_SDIO_INTERRUPT_MSK    0x00000003U
#define SDHOST_SDIO_INTERRUPT_MSK_M  (SDHOST_SDIO_INTERRUPT_MSK_V << SDHOST_SDIO_INTERRUPT_MSK_S)
#define SDHOST_SDIO_INTERRUPT_MSK_V  0x00000003U
#define SDHOST_SDIO_INTERRUPT_MSK_S  16

/** SDHOST_RINTSTS_REG register
 *  Raw interrupt status register
 */
#define SDHOST_RINTSTS_REG (DR_REG_SDHOST_BASE + 0x44)
/** SDHOST_INT_STATUS_RAW : R/W; bitpos: [15:0]; default: 0;
 *  Setting a bit clears the corresponding interrupt and writing 0 has no effect. Bits
 *  are logged regardless of interrupt mask status.
 *  Bit 15 (EBE): End-bit error/no CRC error;
 *  Bit 14 (ACD): Auto command done;
 *  Bit 13 (SBE/BCI): RX Start Bit Error;
 *  Bit 12 (HLE): Hardware locked write error;
 *  Bit 11 (FRUN): FIFO underrun/overrun error;
 *  Bit 10 (HTO): Data starvation by host timeout (HTO);
 *  Bit 9 (DTRO): Data read timeout;
 *  Bit 8 (RTO): Response timeout;
 *  Bit 7 (DCRC): Data CRC error;
 *  Bit 6 (RCRC): Response CRC error;
 *  Bit 5 (RXDR): Receive FIFO data request;
 *  Bit 4 (TXDR): Transmit FIFO data request;
 *  Bit 3 (DTO): Data transfer over;
 *  Bit 2 (CD): Command done;
 *  Bit 1 (RE): Response error;
 *  Bit 0 (CD): Card detect.
 */
#define SDHOST_INT_STATUS_RAW    0x0000FFFFU
#define SDHOST_INT_STATUS_RAW_M  (SDHOST_INT_STATUS_RAW_V << SDHOST_INT_STATUS_RAW_S)
#define SDHOST_INT_STATUS_RAW_V  0x0000FFFFU
#define SDHOST_INT_STATUS_RAW_S  0
/** SDHOST_SDIO_INTERRUPT_RAW : R/W; bitpos: [17:16]; default: 0;
 *  Interrupt from SDIO card, one bit for each card. Bit[17:16] correspond to card1 and
 *  card0, respectively. Setting a bit clears the corresponding interrupt bit and
 *  writing 0 has no effect.
 *  0: No SDIO interrupt from card;
 *  1: SDIO interrupt from card.
 */
#define SDHOST_SDIO_INTERRUPT_RAW    0x00000003U
#define SDHOST_SDIO_INTERRUPT_RAW_M  (SDHOST_SDIO_INTERRUPT_RAW_V << SDHOST_SDIO_INTERRUPT_RAW_S)
#define SDHOST_SDIO_INTERRUPT_RAW_V  0x00000003U
#define SDHOST_SDIO_INTERRUPT_RAW_S  16

/** SDHOST_STATUS_REG register
 *  SD/MMC status register
 */
#define SDHOST_STATUS_REG (DR_REG_SDHOST_BASE + 0x48)
/** SDHOST_FIFO_RX_WATERMARK : RO; bitpos: [0]; default: 0;
 *  FIFO reached Receive watermark level, not qualified with data transfer.
 */
#define SDHOST_FIFO_RX_WATERMARK    (BIT(0))
#define SDHOST_FIFO_RX_WATERMARK_M  (SDHOST_FIFO_RX_WATERMARK_V << SDHOST_FIFO_RX_WATERMARK_S)
#define SDHOST_FIFO_RX_WATERMARK_V  0x00000001U
#define SDHOST_FIFO_RX_WATERMARK_S  0
/** SDHOST_FIFO_TX_WATERMARK : RO; bitpos: [1]; default: 1;
 *  FIFO reached Transmit watermark level, not qualified with data transfer.
 */
#define SDHOST_FIFO_TX_WATERMARK    (BIT(1))
#define SDHOST_FIFO_TX_WATERMARK_M  (SDHOST_FIFO_TX_WATERMARK_V << SDHOST_FIFO_TX_WATERMARK_S)
#define SDHOST_FIFO_TX_WATERMARK_V  0x00000001U
#define SDHOST_FIFO_TX_WATERMARK_S  1
/** SDHOST_FIFO_EMPTY : RO; bitpos: [2]; default: 1;
 *  FIFO is empty status.
 */
#define SDHOST_FIFO_EMPTY    (BIT(2))
#define SDHOST_FIFO_EMPTY_M  (SDHOST_FIFO_EMPTY_V << SDHOST_FIFO_EMPTY_S)
#define SDHOST_FIFO_EMPTY_V  0x00000001U
#define SDHOST_FIFO_EMPTY_S  2
/** SDHOST_FIFO_FULL : RO; bitpos: [3]; default: 0;
 *  FIFO is full status.
 */
#define SDHOST_FIFO_FULL    (BIT(3))
#define SDHOST_FIFO_FULL_M  (SDHOST_FIFO_FULL_V << SDHOST_FIFO_FULL_S)
#define SDHOST_FIFO_FULL_V  0x00000001U
#define SDHOST_FIFO_FULL_S  3
/** SDHOST_COMMAND_FSM_STATES : RO; bitpos: [7:4]; default: 1;
 *  Command FSM states.
 *  0: Idle;
 *  1: Send init sequence;
 *  2: Send cmd start bit;
 *  3: Send cmd tx bit;
 *  4: Send cmd index + arg;
 *  5: Send cmd crc7;
 *  6: Send cmd end bit;
 *  7: Receive resp start bit;
 *  8: Receive resp IRQ response;
 *  9: Receive resp tx bit;
 *  10: Receive resp cmd idx;
 *  11: Receive resp data;
 *  12: Receive resp crc7;
 *  13: Receive resp end bit;
 *  14: Cmd path wait NCC;
 *  15: Wait, cmd-to-response turnaround.
 */
#define SDHOST_COMMAND_FSM_STATES    0x0000000FU
#define SDHOST_COMMAND_FSM_STATES_M  (SDHOST_COMMAND_FSM_STATES_V << SDHOST_COMMAND_FSM_STATES_S)
#define SDHOST_COMMAND_FSM_STATES_V  0x0000000FU
#define SDHOST_COMMAND_FSM_STATES_S  4
/** SDHOST_DATA_3_STATUS : RO; bitpos: [8]; default: 1;
 *  Raw selected sdhost_card_data[3], checks whether card is present.
 *  0: card not present;
 *  1: card present.
 */
#define SDHOST_DATA_3_STATUS    (BIT(8))
#define SDHOST_DATA_3_STATUS_M  (SDHOST_DATA_3_STATUS_V << SDHOST_DATA_3_STATUS_S)
#define SDHOST_DATA_3_STATUS_V  0x00000001U
#define SDHOST_DATA_3_STATUS_S  8
/** SDHOST_DATA_BUSY : RO; bitpos: [9]; default: 1;
 *  Inverted version of raw selected sdhost_card_data[0].
 *  0: Card data not busy;
 *  1: Card data busy.
 */
#define SDHOST_DATA_BUSY    (BIT(9))
#define SDHOST_DATA_BUSY_M  (SDHOST_DATA_BUSY_V << SDHOST_DATA_BUSY_S)
#define SDHOST_DATA_BUSY_V  0x00000001U
#define SDHOST_DATA_BUSY_S  9
/** SDHOST_DATA_STATE_MC_BUSY : RO; bitpos: [10]; default: 1;
 *  Data transmit or receive state-machine is busy.
 */
#define SDHOST_DATA_STATE_MC_BUSY    (BIT(10))
#define SDHOST_DATA_STATE_MC_BUSY_M  (SDHOST_DATA_STATE_MC_BUSY_V << SDHOST_DATA_STATE_MC_BUSY_S)
#define SDHOST_DATA_STATE_MC_BUSY_V  0x00000001U
#define SDHOST_DATA_STATE_MC_BUSY_S  10
/** SDHOST_RESPONSE_INDEX : RO; bitpos: [16:11]; default: 0;
 *  Index of previous response, including any auto-stop sent by core.
 */
#define SDHOST_RESPONSE_INDEX    0x0000003FU
#define SDHOST_RESPONSE_INDEX_M  (SDHOST_RESPONSE_INDEX_V << SDHOST_RESPONSE_INDEX_S)
#define SDHOST_RESPONSE_INDEX_V  0x0000003FU
#define SDHOST_RESPONSE_INDEX_S  11
/** SDHOST_FIFO_COUNT : RO; bitpos: [29:17]; default: 0;
 *  FIFO count, number of filled locations in FIFO.
 */
#define SDHOST_FIFO_COUNT    0x00001FFFU
#define SDHOST_FIFO_COUNT_M  (SDHOST_FIFO_COUNT_V << SDHOST_FIFO_COUNT_S)
#define SDHOST_FIFO_COUNT_V  0x00001FFFU
#define SDHOST_FIFO_COUNT_S  17

