espressif/esp-idf/components/soc/esp32s31/register/soc/sdmmc_reg.h
/** SDHOST_FIFOTH_REG register
 *  FIFO configuration register
 */
#define SDHOST_FIFOTH_REG (DR_REG_SDHOST_BASE + 0x4c)
/** SDHOST_TX_WMARK : R/W; bitpos: [11:0]; default: 0;
 *  FIFO threshold watermark level when transmitting data to card. When FIFO data count
 *  is less than or equal to this number, DMA/FIFO request is raised. If Interrupt is
 *  enabled, then interrupt  occurs. During end of packet, request or interrupt is
 *  generated, regardless of threshold programming.In non-DMA mode, when transmit FIFO
 *  threshold (TXDR) interrupt is enabled, then interrupt is generated instead of DMA
 *  request. During end of packet, on last interrupt, host is responsible for filling
 *  FIFO with only required remaining bytes (not before FIFO is full or after CIU
 *  completes data transfers, because FIFO may not be empty).  In DMA mode, at end of
 *  packet, if last transfer is less than burst  size, DMA controller does single
 *  cycles until required bytes are  transferred.
 */
#define SDHOST_TX_WMARK    0x00000FFFU
#define SDHOST_TX_WMARK_M  (SDHOST_TX_WMARK_V << SDHOST_TX_WMARK_S)
#define SDHOST_TX_WMARK_V  0x00000FFFU
#define SDHOST_TX_WMARK_S  0
/** SDHOST_RX_WMARK : R/W; bitpos: [26:16]; default: 0;
 *  FIFO threshold watermark level when receiving data to card.When FIFO data count
 *  reaches greater than this number , DMA/FIFO request is raised. During end of
 *  packet, request is generated regardless of threshold programming in order to
 *  complete any remaining data.In non-DMA mode, when receiver FIFO threshold (RXDR)
 *  interrupt is enabled, then interrupt is generated instead of DMA request.During end
 *  of packet, interrupt is not generated if threshold programming is larger than any
 *  remaining data. It is responsibility of host to read remaining bytes on seeing Data
 *  Transfer Done interrupt.In DMA mode, at end of packet, even if remaining bytes are
 *  less than threshold, DMA request does single transfers to flush out any remaining
 *  bytes before Data Transfer Done interrupt is set.
 */
#define SDHOST_RX_WMARK    0x000007FFU
#define SDHOST_RX_WMARK_M  (SDHOST_RX_WMARK_V << SDHOST_RX_WMARK_S)
#define SDHOST_RX_WMARK_V  0x000007FFU
#define SDHOST_RX_WMARK_S  16
/** SDHOST_DMA_MULTIPLE_TRANSACTION_SIZE : R/W; bitpos: [30:28]; default: 0;
 *  Burst size of multiple transaction, should be programmed same as DMA controller
 *  multiple-transaction-size SDHOST_SRC/DEST_MSIZE.
 *  000: 1-byte transfer;
 *  001: 4-byte transfer;
 *  010: 8-byte transfer;
 *  011: 16-byte transfer;
 *  100: 32-byte transfer;
 *  101: 64-byte transfer;
 *  110: 128-byte transfer;
 *  111: 256-byte transfer.
 */
#define SDHOST_DMA_MULTIPLE_TRANSACTION_SIZE    0x00000007U
#define SDHOST_DMA_MULTIPLE_TRANSACTION_SIZE_M  (SDHOST_DMA_MULTIPLE_TRANSACTION_SIZE_V << SDHOST_DMA_MULTIPLE_TRANSACTION_SIZE_S)
#define SDHOST_DMA_MULTIPLE_TRANSACTION_SIZE_V  0x00000007U
#define SDHOST_DMA_MULTIPLE_TRANSACTION_SIZE_S  28

/** SDHOST_CDETECT_REG register
 *  Card detect register
 */
#define SDHOST_CDETECT_REG (DR_REG_SDHOST_BASE + 0x50)
/** SDHOST_CARD_DETECT_N : RO; bitpos: [1:0]; default: 0;
 *  Value on sdhost_card_detect_n input ports (1 bit per card), read-only bits. 0
 *  represents presence of card. Only NUM_CARDS number of bits are implemented.
 */
#define SDHOST_CARD_DETECT_N    0x00000003U
#define SDHOST_CARD_DETECT_N_M  (SDHOST_CARD_DETECT_N_V << SDHOST_CARD_DETECT_N_S)
#define SDHOST_CARD_DETECT_N_V  0x00000003U
#define SDHOST_CARD_DETECT_N_S  0

/** SDHOST_WRTPRT_REG register
 *  Card write protection (WP) status register
 */
#define SDHOST_WRTPRT_REG (DR_REG_SDHOST_BASE + 0x54)
/** SDHOST_WRITE_PROTECT : RO; bitpos: [1:0]; default: 0;
 *  Value on sdhost_card_write_prt input ports (1 bit per card). 1 represents write
 *  protection. Only NUM_CARDS number of bits are implemented.
 */
#define SDHOST_WRITE_PROTECT    0x00000003U
#define SDHOST_WRITE_PROTECT_M  (SDHOST_WRITE_PROTECT_V << SDHOST_WRITE_PROTECT_S)
#define SDHOST_WRITE_PROTECT_V  0x00000003U
#define SDHOST_WRITE_PROTECT_S  0

/** SDHOST_TCBCNT_REG register
 *  Transferred byte count register
 */
#define SDHOST_TCBCNT_REG (DR_REG_SDHOST_BASE + 0x5c)
/** SDHOST_TCBCNT : RO; bitpos: [31:0]; default: 0;
 *  Number of bytes transferred by CIU unit to card.
 */
#define SDHOST_TCBCNT    0xFFFFFFFFU
#define SDHOST_TCBCNT_M  (SDHOST_TCBCNT_V << SDHOST_TCBCNT_S)
#define SDHOST_TCBCNT_V  0xFFFFFFFFU
#define SDHOST_TCBCNT_S  0

/** SDHOST_TBBCNT_REG register
 *  Transferred byte count register
 */
#define SDHOST_TBBCNT_REG (DR_REG_SDHOST_BASE + 0x60)
/** SDHOST_TBBCNT : RO; bitpos: [31:0]; default: 0;
 *  Number of bytes transferred between Host/DMA memory and BIU FIFO.
 */
#define SDHOST_TBBCNT    0xFFFFFFFFU
#define SDHOST_TBBCNT_M  (SDHOST_TBBCNT_V << SDHOST_TBBCNT_S)
#define SDHOST_TBBCNT_V  0xFFFFFFFFU
#define SDHOST_TBBCNT_S  0

/** SDHOST_DEBNCE_REG register
 *  Debounce filter time configuration register
 */
#define SDHOST_DEBNCE_REG (DR_REG_SDHOST_BASE + 0x64)
/** SDHOST_DEBOUNCE_COUNT : R/W; bitpos: [23:0]; default: 0;
 *  Number of host clocks (clk) used by debounce filter logic. The typical debounce
 *  time is 5 \verb+~+ 25 ms to prevent the card instability when the card is inserted
 *  or removed.
 */
#define SDHOST_DEBOUNCE_COUNT    0x00FFFFFFU
#define SDHOST_DEBOUNCE_COUNT_M  (SDHOST_DEBOUNCE_COUNT_V << SDHOST_DEBOUNCE_COUNT_S)
#define SDHOST_DEBOUNCE_COUNT_V  0x00FFFFFFU
#define SDHOST_DEBOUNCE_COUNT_S  0

/** SDHOST_USRID_REG register
 *  User ID (scratchpad) register
 */
#define SDHOST_USRID_REG (DR_REG_SDHOST_BASE + 0x68)
/** SDHOST_USRID : R/W; bitpos: [31:0]; default: 0;
 *  User identification register, value set by user. Can also be used as a scratchpad
 *  register by user.
 */
#define SDHOST_USRID    0xFFFFFFFFU
#define SDHOST_USRID_M  (SDHOST_USRID_V << SDHOST_USRID_S)
#define SDHOST_USRID_V  0xFFFFFFFFU
#define SDHOST_USRID_S  0

/** SDHOST_VERID_REG register
 *  Version ID (scratchpad) register
 */
#define SDHOST_VERID_REG (DR_REG_SDHOST_BASE + 0x6c)
/** SDHOST_VERSIONID_REG : RO; bitpos: [31:0]; default: 1412572938;
 *  Hardware version register. Can also be read by fireware.
 */
#define SDHOST_VERSIONID_REG    0xFFFFFFFFU
#define SDHOST_VERSIONID_REG_M  (SDHOST_VERSIONID_REG_V << SDHOST_VERSIONID_REG_S)
#define SDHOST_VERSIONID_REG_V  0xFFFFFFFFU
#define SDHOST_VERSIONID_REG_S  0

/** SDHOST_HCON_REG register
 *  Hardware feature register
 */
#define SDHOST_HCON_REG (DR_REG_SDHOST_BASE + 0x70)
/** SDHOST_CARD_TYPE_REG : RO; bitpos: [0]; default: 1;
 *  Hardware support SDIO and MMC.
 */
#define SDHOST_CARD_TYPE_REG    (BIT(0))
#define SDHOST_CARD_TYPE_REG_M  (SDHOST_CARD_TYPE_REG_V << SDHOST_CARD_TYPE_REG_S)
#define SDHOST_CARD_TYPE_REG_V  0x00000001U
#define SDHOST_CARD_TYPE_REG_S  0
/** SDHOST_CARD_NUM_REG : RO; bitpos: [5:1]; default: 1;
 *  Support card number is 2.
 */
#define SDHOST_CARD_NUM_REG    0x0000001FU
#define SDHOST_CARD_NUM_REG_M  (SDHOST_CARD_NUM_REG_V << SDHOST_CARD_NUM_REG_S)
#define SDHOST_CARD_NUM_REG_V  0x0000001FU
#define SDHOST_CARD_NUM_REG_S  1
/** SDHOST_BUS_TYPE_REG : RO; bitpos: [6]; default: 1;
 *  Register config is APB bus.
 */
#define SDHOST_BUS_TYPE_REG    (BIT(6))
#define SDHOST_BUS_TYPE_REG_M  (SDHOST_BUS_TYPE_REG_V << SDHOST_BUS_TYPE_REG_S)
#define SDHOST_BUS_TYPE_REG_V  0x00000001U
#define SDHOST_BUS_TYPE_REG_S  6
/** SDHOST_DATA_WIDTH_REG : RO; bitpos: [9:7]; default: 1;
 *  Regisger data width is 32.
 */
#define SDHOST_DATA_WIDTH_REG    0x00000007U
#define SDHOST_DATA_WIDTH_REG_M  (SDHOST_DATA_WIDTH_REG_V << SDHOST_DATA_WIDTH_REG_S)
#define SDHOST_DATA_WIDTH_REG_V  0x00000007U
#define SDHOST_DATA_WIDTH_REG_S  7
/** SDHOST_ADDR_WIDTH_REG : RO; bitpos: [15:10]; default: 19;
 *  Register address width is 32.
 */
#define SDHOST_ADDR_WIDTH_REG    0x0000003FU
#define SDHOST_ADDR_WIDTH_REG_M  (SDHOST_ADDR_WIDTH_REG_V << SDHOST_ADDR_WIDTH_REG_S)
#define SDHOST_ADDR_WIDTH_REG_V  0x0000003FU
#define SDHOST_ADDR_WIDTH_REG_S  10
/** SDHOST_DMA_WIDTH_REG : RO; bitpos: [20:18]; default: 1;
 *  DMA data width is 32.
 */
#define SDHOST_DMA_WIDTH_REG    0x00000007U
#define SDHOST_DMA_WIDTH_REG_M  (SDHOST_DMA_WIDTH_REG_V << SDHOST_DMA_WIDTH_REG_S)
#define SDHOST_DMA_WIDTH_REG_V  0x00000007U
#define SDHOST_DMA_WIDTH_REG_S  18
/** SDHOST_RAM_INDISE_REG : RO; bitpos: [21]; default: 0;
 *  Inside RAM in SDMMC module.
 */
#define SDHOST_RAM_INDISE_REG    (BIT(21))
#define SDHOST_RAM_INDISE_REG_M  (SDHOST_RAM_INDISE_REG_V << SDHOST_RAM_INDISE_REG_S)
#define SDHOST_RAM_INDISE_REG_V  0x00000001U
#define SDHOST_RAM_INDISE_REG_S  21
/** SDHOST_HOLD_REG : RO; bitpos: [22]; default: 1;
 *  Have a hold register in data path .
 */
#define SDHOST_HOLD_REG    (BIT(22))
#define SDHOST_HOLD_REG_M  (SDHOST_HOLD_REG_V << SDHOST_HOLD_REG_S)
#define SDHOST_HOLD_REG_V  0x00000001U
#define SDHOST_HOLD_REG_S  22
/** SDHOST_NUM_CLK_DIV_REG : RO; bitpos: [25:24]; default: 3;
 *  Have 4 clk divider in design .
 */
#define SDHOST_NUM_CLK_DIV_REG    0x00000003U
#define SDHOST_NUM_CLK_DIV_REG_M  (SDHOST_NUM_CLK_DIV_REG_V << SDHOST_NUM_CLK_DIV_REG_S)
#define SDHOST_NUM_CLK_DIV_REG_V  0x00000003U
#define SDHOST_NUM_CLK_DIV_REG_S  24

/** SDHOST_UHS_REG register
 *  UHS-1 register
 */
#define SDHOST_UHS_REG (DR_REG_SDHOST_BASE + 0x74)
/** SDHOST_DDR_REG : R/W; bitpos: [17:16]; default: 0;
 *  DDR mode selection,1 bit for each card.
 *  0-Non-DDR mode.
 *  1-DDR mode.
 */
#define SDHOST_DDR_REG    0x00000003U
#define SDHOST_DDR_REG_M  (SDHOST_DDR_REG_V << SDHOST_DDR_REG_S)
#define SDHOST_DDR_REG_V  0x00000003U
#define SDHOST_DDR_REG_S  16

/** SDHOST_RST_N_REG register
 *  Card reset register
 */
#define SDHOST_RST_N_REG (DR_REG_SDHOST_BASE + 0x78)
/** SDHOST_CARD_RESET : R/W; bitpos: [1:0]; default: 1;
 *  Hardware reset.
 *  1: Active mode;
 *  0: Reset.
 *  These bits cause the cards to enter pre-idle state, which requires them to be
 *  re-initialized. SDHOST_RST_CARD_RESET[0] should be set to 1'b0 to reset card0,
 *  SDHOST_RST_CARD_RESET[1] should be set to 1'b0 to reset card1.
 */
#define SDHOST_CARD_RESET    0x00000003U
#define SDHOST_CARD_RESET_M  (SDHOST_CARD_RESET_V << SDHOST_CARD_RESET_S)
#define SDHOST_CARD_RESET_V  0x00000003U
#define SDHOST_CARD_RESET_S  0

/** SDHOST_BMOD_REG register
 *  Burst mode transfer configuration register
 */
#define SDHOST_BMOD_REG (DR_REG_SDHOST_BASE + 0x80)
/** SDHOST_BMOD_SWR : R/W; bitpos: [0]; default: 0;
 *  Software Reset. When set, the DMA Controller resets all its internal registers. It
 *  is automatically cleared after one clock cycle.
 */
#define SDHOST_BMOD_SWR    (BIT(0))
#define SDHOST_BMOD_SWR_M  (SDHOST_BMOD_SWR_V << SDHOST_BMOD_SWR_S)
#define SDHOST_BMOD_SWR_V  0x00000001U
#define SDHOST_BMOD_SWR_S  0
/** SDHOST_BMOD_FB : R/W; bitpos: [1]; default: 0;
 *  Fixed Burst. Controls whether the AHB Master interface performs fixed burst
 *  transfers or not. When set, the AHB will use only SINGLE, INCR4, INCR8 or INCR16
 *  during start of normal burst transfers. When reset, the AHB will use SINGLE and
 *  INCR burst transfer operations.
 */
#define SDHOST_BMOD_FB    (BIT(1))
#define SDHOST_BMOD_FB_M  (SDHOST_BMOD_FB_V << SDHOST_BMOD_FB_S)
#define SDHOST_BMOD_FB_V  0x00000001U
#define SDHOST_BMOD_FB_S  1
/** SDHOST_BMOD_DE : R/W; bitpos: [7]; default: 0;
 *  IDMAC Enable. When set, the IDMAC is enabled.
 */
#define SDHOST_BMOD_DE    (BIT(7))
#define SDHOST_BMOD_DE_M  (SDHOST_BMOD_DE_V << SDHOST_BMOD_DE_S)
#define SDHOST_BMOD_DE_V  0x00000001U
#define SDHOST_BMOD_DE_S  7
/** SDHOST_BMOD_PBL : R/W; bitpos: [10:8]; default: 0;
 *  Programmable Burst Length. These bits indicate the maximum number of beats to be
 *  performed in one IDMAC???Internal DMA Control???transaction. The IDMAC will always
 *  attempt to burst as specified in PBL each time it starts a burst transfer on the
 *  host bus. The permissible values are 1, 4, 8, 16, 32, 64, 128 and 256. This value
 *  is the mirror of MSIZE of FIFOTH register. In order to change this value, write the
 *  required value to FIFOTH register. This is an encode value as follows:
 *  000: 1-byte transfer;
 *  001: 4-byte transfer;
 *  010: 8-byte transfer;
 *  011: 16-byte transfer;
 *  100: 32-byte transfer;
 *  101: 64-byte transfer;
 *  110: 128-byte transfer;
 *  111: 256-byte transfer.
 *  PBL is a read-only value and is applicable only for data access, it does not apply
 *  to descriptor access.
 */
#define SDHOST_BMOD_PBL    0x00000007U
#define SDHOST_BMOD_PBL_M  (SDHOST_BMOD_PBL_V << SDHOST_BMOD_PBL_S)
#define SDHOST_BMOD_PBL_V  0x00000007U
#define SDHOST_BMOD_PBL_S  8

/** SDHOST_PLDMND_REG register
 *  Poll demand configuration register
 */
#define SDHOST_PLDMND_REG (DR_REG_SDHOST_BASE + 0x84)
/** SDHOST_PLDMND_PD : WO; bitpos: [31:0]; default: 0;
 *  Poll Demand. If the OWNER bit of a descriptor is not set, the FSM goes to the
 *  Suspend state. The host needs to write any value into this register for the IDMAC
 *  FSM to resume normal descriptor fetch operation. This is a write only .
 */
#define SDHOST_PLDMND_PD    0xFFFFFFFFU
#define SDHOST_PLDMND_PD_M  (SDHOST_PLDMND_PD_V << SDHOST_PLDMND_PD_S)
#define SDHOST_PLDMND_PD_V  0xFFFFFFFFU
#define SDHOST_PLDMND_PD_S  0

/** SDHOST_DBADDR_REG register
 *  Descriptor base address register
 */
#define SDHOST_DBADDR_REG (DR_REG_SDHOST_BASE + 0x88)
/** SDHOST_DBADDR : R/W; bitpos: [31:0]; default: 0;
 *  Start of Descriptor List. Contains the base address of the First Descriptor. The
 *  LSB bits [1:0] are ignored and taken as all-zero by the IDMAC internally. Hence
 *  these LSB bits may be treated as read-only.
 */
#define SDHOST_DBADDR    0xFFFFFFFFU
#define SDHOST_DBADDR_M  (SDHOST_DBADDR_V << SDHOST_DBADDR_S)
#define SDHOST_DBADDR_V  0xFFFFFFFFU
#define SDHOST_DBADDR_S  0

/** SDHOST_IDSTS_REG register
 *  IDMAC status register
 */
#define SDHOST_IDSTS_REG (DR_REG_SDHOST_BASE + 0x8c)
/** SDHOST_IDSTS_TI : R/W; bitpos: [0]; default: 0;
 *  Transmit Interrupt. Indicates that data transmission is finished for a descriptor.
 *  Writing 1 clears this bit.
 */
#define SDHOST_IDSTS_TI    (BIT(0))
#define SDHOST_IDSTS_TI_M  (SDHOST_IDSTS_TI_V << SDHOST_IDSTS_TI_S)
#define SDHOST_IDSTS_TI_V  0x00000001U
#define SDHOST_IDSTS_TI_S  0
/** SDHOST_IDSTS_RI : R/W; bitpos: [1]; default: 0;
 *  Receive Interrupt. Indicates the completion of data reception for a descriptor.
 *  Writing 1 clears this bit.
 */
#define SDHOST_IDSTS_RI    (BIT(1))
#define SDHOST_IDSTS_RI_M  (SDHOST_IDSTS_RI_V << SDHOST_IDSTS_RI_S)
#define SDHOST_IDSTS_RI_V  0x00000001U
#define SDHOST_IDSTS_RI_S  1
/** SDHOST_IDSTS_FBE : R/W; bitpos: [2]; default: 0;
 *  Fatal Bus Error Interrupt. Indicates that a Bus Error occurred (IDSTS[12:10]) .
 *  When this bit is set, the DMA disables all its bus accesses. Writing 1 clears this
 *  bit.
 */
#define SDHOST_IDSTS_FBE    (BIT(2))
#define SDHOST_IDSTS_FBE_M  (SDHOST_IDSTS_FBE_V << SDHOST_IDSTS_FBE_S)
#define SDHOST_IDSTS_FBE_V  0x00000001U
#define SDHOST_IDSTS_FBE_S  2
/** SDHOST_IDSTS_DU : R/W; bitpos: [4]; default: 0;
 *  Descriptor Unavailable Interrupt. This bit is set when the descriptor is
 *  unavailable due to OWNER bit = 0 (DES0[31] = 0). Writing 1 clears this bit.
 */
#define SDHOST_IDSTS_DU    (BIT(4))
#define SDHOST_IDSTS_DU_M  (SDHOST_IDSTS_DU_V << SDHOST_IDSTS_DU_S)
#define SDHOST_IDSTS_DU_V  0x00000001U
#define SDHOST_IDSTS_DU_S  4
/** SDHOST_IDSTS_CES : R/W; bitpos: [5]; default: 0;
 *  Card Error Summary. Indicates the status of the transaction to/from the card, also
 *  present in RINTSTS. Indicates the logical OR of the following bits:
 *  EBE : End Bit Error;
 *  RTO : Response Timeout/Boot Ack Timeout;
 *  RCRC : Response CRC;
 *  SBE : Start Bit Error;
 *  DRTO : Data Read Timeout/BDS timeout;
 *  DCRC : Data CRC for Receive;
 *  RE : Response Error.
 *  Writing 1 clears this bit. The abort condition of the IDMAC depends on the setting
 *  of this CES bit. If the CES bit is enabled, then the IDMAC aborts on a response
 *  error.
 */
#define SDHOST_IDSTS_CES    (BIT(5))
#define SDHOST_IDSTS_CES_M  (SDHOST_IDSTS_CES_V << SDHOST_IDSTS_CES_S)
#define SDHOST_IDSTS_CES_V  0x00000001U
#define SDHOST_IDSTS_CES_S  5
/** SDHOST_IDSTS_NIS : R/W; bitpos: [8]; default: 0;
 *  Normal Interrupt Summary. Logical OR of the following: IDSTS[0] : Transmit
 *  Interrupt, IDSTS[1] : Receive Interrupt. Only unmasked bits affect this bit. This
 *  is a sticky bit and must be cleared each time a corresponding bit that causes NIS
 *  to be set is cleared. Writing 1 clears this bit.
 */
#define SDHOST_IDSTS_NIS    (BIT(8))
#define SDHOST_IDSTS_NIS_M  (SDHOST_IDSTS_NIS_V << SDHOST_IDSTS_NIS_S)
#define SDHOST_IDSTS_NIS_V  0x00000001U
#define SDHOST_IDSTS_NIS_S  8
/** SDHOST_IDSTS_AIS : R/W; bitpos: [9]; default: 0;
 *  Abnormal Interrupt Summary. Logical OR of the following: IDSTS[2] : Fatal Bus
 *  Interrupt, IDSTS[4] : DU bit Interrupt. Only unmasked bits affect this bit. This is
 *  a sticky bit and must be cleared each time a corresponding bit that causes AIS to
 *  be set is cleared. Writing 1 clears this bit.
 */
#define SDHOST_IDSTS_AIS    (BIT(9))
#define SDHOST_IDSTS_AIS_M  (SDHOST_IDSTS_AIS_V << SDHOST_IDSTS_AIS_S)
#define SDHOST_IDSTS_AIS_V  0x00000001U
#define SDHOST_IDSTS_AIS_S  9
/** SDHOST_IDSTS_FBE_CODE : R/W; bitpos: [12:10]; default: 0;
 *  Fatal Bus Error Code. Indicates the type of error that caused a Bus Error. Valid
 *  only when the Fatal Bus Error bit IDSTS[2] is set. This field does not generate an
 *  interrupt.
 *  001: Host Abort received during transmission;
 *  010: Host Abort received during reception;
 *  Others: Reserved.
 */
#define SDHOST_IDSTS_FBE_CODE    0x00000007U
#define SDHOST_IDSTS_FBE_CODE_M  (SDHOST_IDSTS_FBE_CODE_V << SDHOST_IDSTS_FBE_CODE_S)
#define SDHOST_IDSTS_FBE_CODE_V  0x00000007U
#define SDHOST_IDSTS_FBE_CODE_S  10
/** SDHOST_IDSTS_FSM : R/W; bitpos: [16:13]; default: 0;
 *  DMAC FSM present state.
 *  0: DMA_IDLE (idle state);
 *  1: DMA_SUSPEND (suspend state);
 *  2: DESC_RD (descriptor reading state);
 *  3: DESC_CHK (descriptor checking state);
 *  4: DMA_RD_REQ_WAIT (read-data request waiting state);
 *  5: DMA_WR_REQ_WAIT (write-data request waiting state);
 *  6: DMA_RD (data-read state);
 *  7: DMA_WR (data-write state);
 *  8: DESC_CLOSE (descriptor close state).
 */
#define SDHOST_IDSTS_FSM    0x0000000FU
#define SDHOST_IDSTS_FSM_M  (SDHOST_IDSTS_FSM_V << SDHOST_IDSTS_FSM_S)
#define SDHOST_IDSTS_FSM_V  0x0000000FU
#define SDHOST_IDSTS_FSM_S  13

