espressif/esp-idf/components/soc/esp32s31/register/soc/sdmmc_reg.h
/** SDHOST_BUFFIFO_REG register
 *  CPU write and read transmit data by FIFO
 */
#define SDHOST_BUFFIFO_REG (DR_REG_SDHOST_BASE + 0x200)
/** SDHOST_BUFFIFO : R/W; bitpos: [31:0]; default: 0;
 *  CPU write and read transmit data by FIFO. This register points to the current Data
 *  FIFO .
 */
#define SDHOST_BUFFIFO    0xFFFFFFFFU
#define SDHOST_BUFFIFO_M  (SDHOST_BUFFIFO_V << SDHOST_BUFFIFO_S)
#define SDHOST_BUFFIFO_V  0xFFFFFFFFU
#define SDHOST_BUFFIFO_S  0

/** SDHOST_CLK_EDGE_SEL_REG register
 *  SDIO control register.
 */
#define SDHOST_CLK_EDGE_SEL_REG (DR_REG_SDHOST_BASE + 0x800)
/** SDHOST_CCLKIN_EDGE_DRV_SEL : R/W; bitpos: [2:0]; default: 0;
 *  It's used to select the clock phase of the output signal from phase 0, phase 90,
 *  phase 180, phase 270.
 */
#define SDHOST_CCLKIN_EDGE_DRV_SEL    0x00000007U
#define SDHOST_CCLKIN_EDGE_DRV_SEL_M  (SDHOST_CCLKIN_EDGE_DRV_SEL_V << SDHOST_CCLKIN_EDGE_DRV_SEL_S)
#define SDHOST_CCLKIN_EDGE_DRV_SEL_V  0x00000007U
#define SDHOST_CCLKIN_EDGE_DRV_SEL_S  0
/** SDHOST_CCLKIN_EDGE_SAM_SEL : R/W; bitpos: [5:3]; default: 0;
 *  It's used to select the clock phase of the input signal from phase 0, phase 90,
 *  phase 180, phase 270.
 */
#define SDHOST_CCLKIN_EDGE_SAM_SEL    0x00000007U
#define SDHOST_CCLKIN_EDGE_SAM_SEL_M  (SDHOST_CCLKIN_EDGE_SAM_SEL_V << SDHOST_CCLKIN_EDGE_SAM_SEL_S)
#define SDHOST_CCLKIN_EDGE_SAM_SEL_V  0x00000007U
#define SDHOST_CCLKIN_EDGE_SAM_SEL_S  3
/** SDHOST_CCLKIN_EDGE_SLF_SEL : R/W; bitpos: [8:6]; default: 0;
 *  It's used to select the clock phase of the internal signal from phase 0, phase 90,
 *  phase 180, phase 270.
 */
#define SDHOST_CCLKIN_EDGE_SLF_SEL    0x00000007U
#define SDHOST_CCLKIN_EDGE_SLF_SEL_M  (SDHOST_CCLKIN_EDGE_SLF_SEL_V << SDHOST_CCLKIN_EDGE_SLF_SEL_S)
#define SDHOST_CCLKIN_EDGE_SLF_SEL_V  0x00000007U
#define SDHOST_CCLKIN_EDGE_SLF_SEL_S  6
/** SDHOST_CCLLKIN_EDGE_H : R/W; bitpos: [12:9]; default: 1;
 *  The high level of the divider clock. The value should be smaller than CCLKIN_EDGE_L.
 */
#define SDHOST_CCLLKIN_EDGE_H    0x0000000FU
#define SDHOST_CCLLKIN_EDGE_H_M  (SDHOST_CCLLKIN_EDGE_H_V << SDHOST_CCLLKIN_EDGE_H_S)
#define SDHOST_CCLLKIN_EDGE_H_V  0x0000000FU
#define SDHOST_CCLLKIN_EDGE_H_S  9
/** SDHOST_CCLLKIN_EDGE_L : R/W; bitpos: [16:13]; default: 0;
 *  The low level of the divider clock. The value should be larger than CCLKIN_EDGE_H.
 */
#define SDHOST_CCLLKIN_EDGE_L    0x0000000FU
#define SDHOST_CCLLKIN_EDGE_L_M  (SDHOST_CCLLKIN_EDGE_L_V << SDHOST_CCLLKIN_EDGE_L_S)
#define SDHOST_CCLLKIN_EDGE_L_V  0x0000000FU
#define SDHOST_CCLLKIN_EDGE_L_S  13
/** SDHOST_CCLLKIN_EDGE_N : R/W; bitpos: [20:17]; default: 1;
 *  The clock division of cclk_in.
 */
#define SDHOST_CCLLKIN_EDGE_N    0x0000000FU
#define SDHOST_CCLLKIN_EDGE_N_M  (SDHOST_CCLLKIN_EDGE_N_V << SDHOST_CCLLKIN_EDGE_N_S)
#define SDHOST_CCLLKIN_EDGE_N_V  0x0000000FU
#define SDHOST_CCLLKIN_EDGE_N_S  17
/** SDHOST_ESDIO_MODE : R/W; bitpos: [21]; default: 0;
 *  Enable esdio mode.
 */
#define SDHOST_ESDIO_MODE    (BIT(21))
#define SDHOST_ESDIO_MODE_M  (SDHOST_ESDIO_MODE_V << SDHOST_ESDIO_MODE_S)
#define SDHOST_ESDIO_MODE_V  0x00000001U
#define SDHOST_ESDIO_MODE_S  21
/** SDHOST_ESD_MODE : R/W; bitpos: [22]; default: 0;
 *  Enable esd mode.
 */
#define SDHOST_ESD_MODE    (BIT(22))
#define SDHOST_ESD_MODE_M  (SDHOST_ESD_MODE_V << SDHOST_ESD_MODE_S)
#define SDHOST_ESD_MODE_V  0x00000001U
#define SDHOST_ESD_MODE_S  22
/** SDHOST_CCLK_EN : R/W; bitpos: [23]; default: 1;
 *  Sdio clock enable.
 */
#define SDHOST_CCLK_EN    (BIT(23))
#define SDHOST_CCLK_EN_M  (SDHOST_CCLK_EN_V << SDHOST_CCLK_EN_S)
#define SDHOST_CCLK_EN_V  0x00000001U
#define SDHOST_CCLK_EN_S  23
/** SDHOST_ULTRA_HIGH_SPEED_MODE : R/W; bitpos: [24]; default: 0;
 *  Enable ultra high speed mode, use dll to generate clk.
 */
#define SDHOST_ULTRA_HIGH_SPEED_MODE    (BIT(24))
#define SDHOST_ULTRA_HIGH_SPEED_MODE_M  (SDHOST_ULTRA_HIGH_SPEED_MODE_V << SDHOST_ULTRA_HIGH_SPEED_MODE_S)
#define SDHOST_ULTRA_HIGH_SPEED_MODE_V  0x00000001U
#define SDHOST_ULTRA_HIGH_SPEED_MODE_S  24

/** SDHOST_RAW_INTS_REG register
 *  SDIO raw ints register.
 */
#define SDHOST_RAW_INTS_REG (DR_REG_SDHOST_BASE + 0x804)
/** SDHOST_RAW_INTS : RO; bitpos: [31:0]; default: 0;
 *  It indicates raw ints.
 */
#define SDHOST_RAW_INTS    0xFFFFFFFFU
#define SDHOST_RAW_INTS_M  (SDHOST_RAW_INTS_V << SDHOST_RAW_INTS_S)
#define SDHOST_RAW_INTS_V  0xFFFFFFFFU
#define SDHOST_RAW_INTS_S  0

/** SDHOST_DLL_CLK_CONF_REG register
 *  SDIO DLL clock control register.
 */
#define SDHOST_DLL_CLK_CONF_REG (DR_REG_SDHOST_BASE + 0x808)
/** SDHOST_DLL_CCLK_IN_SLF_EN : R/W; bitpos: [0]; default: 0;
 *  Clock enable of cclk_in_slf when ULTRA_HIGH_SPEED_MODE==1.
 */
#define SDHOST_DLL_CCLK_IN_SLF_EN    (BIT(0))
#define SDHOST_DLL_CCLK_IN_SLF_EN_M  (SDHOST_DLL_CCLK_IN_SLF_EN_V << SDHOST_DLL_CCLK_IN_SLF_EN_S)
#define SDHOST_DLL_CCLK_IN_SLF_EN_V  0x00000001U
#define SDHOST_DLL_CCLK_IN_SLF_EN_S  0
/** SDHOST_DLL_CCLK_IN_DRV_EN : R/W; bitpos: [1]; default: 0;
 *  Clock enable of cclk_in_drv when ULTRA_HIGH_SPEED_MODE==1.
 */
#define SDHOST_DLL_CCLK_IN_DRV_EN    (BIT(1))
#define SDHOST_DLL_CCLK_IN_DRV_EN_M  (SDHOST_DLL_CCLK_IN_DRV_EN_V << SDHOST_DLL_CCLK_IN_DRV_EN_S)
#define SDHOST_DLL_CCLK_IN_DRV_EN_V  0x00000001U
#define SDHOST_DLL_CCLK_IN_DRV_EN_S  1
/** SDHOST_DLL_CCLK_IN_SAM_EN : R/W; bitpos: [2]; default: 0;
 *  Clock enable of cclk_in_sam when ULTRA_HIGH_SPEED_MODE==1.
 */
#define SDHOST_DLL_CCLK_IN_SAM_EN    (BIT(2))
#define SDHOST_DLL_CCLK_IN_SAM_EN_M  (SDHOST_DLL_CCLK_IN_SAM_EN_V << SDHOST_DLL_CCLK_IN_SAM_EN_S)
#define SDHOST_DLL_CCLK_IN_SAM_EN_V  0x00000001U
#define SDHOST_DLL_CCLK_IN_SAM_EN_S  2
/** SDHOST_DLL_CCLK_IN_SLF_PHASE : R/W; bitpos: [8:3]; default: 0;
 *  It's used to control the phase of cclk_in_slf when ULTRA_HIGH_SPEED_MODE==1.
 */
#define SDHOST_DLL_CCLK_IN_SLF_PHASE    0x0000003FU
#define SDHOST_DLL_CCLK_IN_SLF_PHASE_M  (SDHOST_DLL_CCLK_IN_SLF_PHASE_V << SDHOST_DLL_CCLK_IN_SLF_PHASE_S)
#define SDHOST_DLL_CCLK_IN_SLF_PHASE_V  0x0000003FU
#define SDHOST_DLL_CCLK_IN_SLF_PHASE_S  3
/** SDHOST_DLL_CCLK_IN_DRV_PHASE : R/W; bitpos: [14:9]; default: 0;
 *  It's used to control the phase of cclk_in_drv when ULTRA_HIGH_SPEED_MODE==1.
 */
#define SDHOST_DLL_CCLK_IN_DRV_PHASE    0x0000003FU
#define SDHOST_DLL_CCLK_IN_DRV_PHASE_M  (SDHOST_DLL_CCLK_IN_DRV_PHASE_V << SDHOST_DLL_CCLK_IN_DRV_PHASE_S)
#define SDHOST_DLL_CCLK_IN_DRV_PHASE_V  0x0000003FU
#define SDHOST_DLL_CCLK_IN_DRV_PHASE_S  9
/** SDHOST_DLL_CCLK_IN_SAM_PHASE : R/W; bitpos: [20:15]; default: 0;
 *  It's used to control the phase of cclk_in_sam when ULTRA_HIGH_SPEED_MODE==1.
 */
#define SDHOST_DLL_CCLK_IN_SAM_PHASE    0x0000003FU
#define SDHOST_DLL_CCLK_IN_SAM_PHASE_M  (SDHOST_DLL_CCLK_IN_SAM_PHASE_V << SDHOST_DLL_CCLK_IN_SAM_PHASE_S)
#define SDHOST_DLL_CCLK_IN_SAM_PHASE_V  0x0000003FU
#define SDHOST_DLL_CCLK_IN_SAM_PHASE_S  15

/** SDHOST_DLL_CONF_REG register
 *  SDIO DLL configuration register.
 */
#define SDHOST_DLL_CONF_REG (DR_REG_SDHOST_BASE + 0x80c)
/** SDHOST_DLL_CAL_STOP : R/W; bitpos: [0]; default: 0;
 *  Set 1 to stop calibration.
 */
#define SDHOST_DLL_CAL_STOP    (BIT(0))
#define SDHOST_DLL_CAL_STOP_M  (SDHOST_DLL_CAL_STOP_V << SDHOST_DLL_CAL_STOP_S)
#define SDHOST_DLL_CAL_STOP_V  0x00000001U
#define SDHOST_DLL_CAL_STOP_S  0
/** SDHOST_DLL_CAL_END : RO; bitpos: [1]; default: 0;
 *  1 means calibration finished.
 */
#define SDHOST_DLL_CAL_END    (BIT(1))
#define SDHOST_DLL_CAL_END_M  (SDHOST_DLL_CAL_END_V << SDHOST_DLL_CAL_END_S)
#define SDHOST_DLL_CAL_END_V  0x00000001U
#define SDHOST_DLL_CAL_END_S  1

#define SDMMC_INTMASK_IO_SLOT1  BIT(17)
#define SDMMC_INTMASK_IO_SLOT0  BIT(16)
#define SDMMC_INTMASK_EBE       BIT(15)
#define SDMMC_INTMASK_ACD       BIT(14)
#define SDMMC_INTMASK_SBE       BIT(13)
#define SDMMC_INTMASK_HLE       BIT(12)
#define SDMMC_INTMASK_FRUN      BIT(11)
#define SDMMC_INTMASK_HTO       BIT(10)
#define SDMMC_INTMASK_VOLT_SW   SDMMC_INTMASK_HTO
#define SDMMC_INTMASK_DTO       BIT(9)
#define SDMMC_INTMASK_RTO       BIT(8)
#define SDMMC_INTMASK_DCRC      BIT(7)
#define SDMMC_INTMASK_RCRC      BIT(6)
#define SDMMC_INTMASK_RXDR      BIT(5)
#define SDMMC_INTMASK_TXDR      BIT(4)
#define SDMMC_INTMASK_DATA_OVER BIT(3)
#define SDMMC_INTMASK_CMD_DONE  BIT(2)
#define SDMMC_INTMASK_RESP_ERR  BIT(1)
#define SDMMC_INTMASK_CD        BIT(0)

#define SDMMC_IDMAC_INTMASK_AI  BIT(9)
#define SDMMC_IDMAC_INTMASK_NI  BIT(8)
#define SDMMC_IDMAC_INTMASK_CES BIT(5)
#define SDMMC_IDMAC_INTMASK_DU  BIT(4)
#define SDMMC_IDMAC_INTMASK_FBE BIT(2)
#define SDMMC_IDMAC_INTMASK_RI  BIT(1)
#define SDMMC_IDMAC_INTMASK_TI  BIT(0)

#ifdef __cplusplus
}
#endif
